; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph3 - mode
	thermograph1 - mode
	infrared0 - mode
	image2 - mode
	GroundStation4 - direction
	GroundStation2 - direction
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet15)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star0)
	(supports instrument9 image2)
	(calibration_target instrument9 Star3)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(have_image Phenomenon5 image2)
	(have_image Planet6 image2)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 thermograph3)
	(have_image Star9 thermograph3)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Phenomenon13 image2)
	(have_image Planet14 thermograph3)
	(have_image Planet15 image2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (turn_to satellite2 groundstation2 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 12
4. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 12
5. (turn_to satellite2 phenomenon10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon10)
   goals met: 0 of 12
6. (take_image satellite2 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 1 of 12
7. (turn_to satellite2 phenomenon12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon12)
   goals met: 1 of 12
8. (take_image satellite2 phenomenon12 instrument5 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 2 of 12
9. (turn_to satellite2 phenomenon13 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 12
10. (take_image satellite2 phenomenon13 instrument5 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 12
11. (turn_to satellite2 phenomenon5 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon5)
   goals met: 3 of 12
12. (take_image satellite2 phenomenon5 instrument5 image2)
   added: (have_image phenomenon5 image2)
   goals met: 4 of 12
13. (turn_to satellite2 phenomenon7 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon7)
   goals met: 4 of 12
14. (take_image satellite2 phenomenon7 instrument5 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 5 of 12
15. (turn_to satellite2 planet15 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet15)
   goals met: 5 of 12
16. (take_image satellite2 planet15 instrument5 image2)
   added: (have_image planet15 image2)
   goals met: 6 of 12
17. (turn_to satellite2 planet6 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet6)
   goals met: 6 of 12
18. (take_image satellite2 planet6 instrument5 image2)
   added: (have_image planet6 image2)
   goals met: 7 of 12
19. (turn_to satellite2 star11 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star11)
   goals met: 7 of 12
20. (take_image satellite2 star11 instrument5 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 12
21. (turn_to satellite0 groundstation2 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation2)
   goals met: 8 of 12
22. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 8 of 12
23. (turn_to satellite0 phenomenon7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon7)
   goals met: 9 of 12
24. (turn_to satellite0 planet14 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet14)
   goals met: 8 of 12
25. (take_image satellite0 planet14 instrument0 thermograph3)
   added: (have_image planet14 thermograph3)
   goals met: 9 of 12
26. (turn_to satellite0 phenomenon7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon7)
   goals met: 10 of 12
27. (turn_to satellite0 star8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star8)
   goals met: 9 of 12
28. (take_image satellite0 star8 instrument0 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 10 of 12
29. (turn_to satellite0 phenomenon7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon7)
   goals met: 11 of 12
30. (turn_to satellite0 star9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star9)
   goals met: 10 of 12
31. (take_image satellite0 star9 instrument0 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 11 of 12
32. (turn_to satellite0 phenomenon7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon7)
   goals met: 12 of 12
